# Дана матрица A размера 2xN, каждый столбец - координаты точки на плоскости. 
# В этой задаче функция не должна возвращать результат, 
# она должна только рисовать одну картинку
# - Изобразите множество A
# - Изобразите центр масс множества A (одна точка, другой маркер, другой цвет)
# - Изобразите множество B, которое получается параллельным переносом множества A так, 
#   чтобы его центр масс перешел в 0. (Новый тип маркера, новый цвет). 
#   Напоминание: при параллельном переносе на вектор dx, dy координаты точки x, y 
#   заменяются на x + dx, y + dy.
# - Изобразите множество C: поворот множества A вокруг нуля на 45 градусов. 
#  (Новый тип маркера, новый цвет). 
#   Напоминание. Чтобы повернуть точку с координатами x, y на угол fi относительно нуля, 
#   нужно домножить вектор столбец [x;y] слева на матрицу [cos(fi) sin(fi); -sin(fi) cos(fi)]
# - Изобразите множество D: поворот множества А вокруг его центра масс на 10 градусов.

function M = task3()
  
endfunction